; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v5 ?v6)
             (pred_9 ?v7 ?v1)
             (pred_1 ?v5 ?v1)
             (pred_7 ?v9 ?v5 )
	     (pred_3 ?v5)
             (pred_6 ?v11)
             (pred_4 ?v7)
             (pred_10 ?v1)
             (pred_5 ?v5)
             (pred_11 ?v7)
             (pred_8 ?v5)
             (pred_2 ))



(:action op_1
:parameters (?v8 ?v12 ?v10 ?v2)
:precondition (and (pred_6 ?v8) (pred_6 ?v12) (pred_4 ?v10) (pred_10 ?v2)
          (pred_12 ?v8 ?v12) (pred_9 ?v10 ?v2)
                   (pred_1 ?v12 ?v2) (pred_3 ?v8) 
                   (pred_5 ?v12) (pred_11 ?v10))
:effect (and  (pred_8 ?v12) (not (pred_5 ?v12))))


(:action op_5
:parameters (?v8 ?v13)
:precondition (and (pred_6 ?v8) (pred_6 ?v13)
               (pred_3 ?v8) (pred_12 ?v8 ?v13) (pred_8 ?v13))
:effect (and (pred_3 ?v13) (not (pred_3 ?v8))))

(:action op_3
:parameters (?v8 ?v10)
:precondition (and (pred_6 ?v8) (pred_4 ?v10) 
                  (pred_3 ?v8) (pred_7 ?v10 ?v8) (pred_2 ))
:effect (and (pred_11 ?v10)
   (not (pred_7 ?v10 ?v8)) (not (pred_2 ))))


(:action op_4
:parameters (?v8 ?v4 ?v3)
:precondition (and (pred_6 ?v8) (pred_4 ?v4) (pred_4 ?v3)
                  (pred_3 ?v8) (pred_11 ?v3) (pred_7 ?v4 ?v8))
:effect (and (pred_11 ?v4) (pred_7 ?v3 ?v8)
        (not (pred_11 ?v3)) (not (pred_7 ?v4 ?v8))))

(:action op_2
:parameters (?v8 ?v10)
:precondition (and (pred_6 ?v8) (pred_4 ?v10) 
                  (pred_3 ?v8) (pred_11 ?v10))
:effect (and (pred_2 ) (pred_7 ?v10 ?v8) (not (pred_11 ?v10)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_19 obj_05 obj_04 obj_10 obj_18 obj_14 obj_15 obj_20 obj_01 obj_17 obj_03 obj_07 obj_12 obj_02 obj_16 obj_09
    obj_13 obj_06
    obj_08 obj_11
    )

    (:init
       (pred_2)

       (pred_6 obj_19)
       (pred_6 obj_05)
       (pred_6 obj_04)
       (pred_6 obj_10)
       (pred_6 obj_18)
       (pred_6 obj_14)
       (pred_6 obj_15)
       (pred_6 obj_20)
       (pred_6 obj_01)
       (pred_6 obj_17)
       (pred_6 obj_03)
       (pred_6 obj_07)
       (pred_6 obj_12)
       (pred_6 obj_02)
       (pred_6 obj_16)
       (pred_6 obj_09)
       (pred_10 obj_13)
       (pred_10 obj_06)
       (pred_4 obj_08)
       (pred_4 obj_11)

       (pred_12 obj_19 obj_18)
       (pred_12 obj_19 obj_05)
       (pred_12 obj_05 obj_14)
       (pred_12 obj_05 obj_04)
       (pred_12 obj_05 obj_19)
       (pred_12 obj_04 obj_15)
       (pred_12 obj_04 obj_10)
       (pred_12 obj_04 obj_05)
       (pred_12 obj_10 obj_20)
       (pred_12 obj_10 obj_04)
       (pred_12 obj_18 obj_01)
       (pred_12 obj_18 obj_14)
       (pred_12 obj_18 obj_19)
       (pred_12 obj_14 obj_17)
       (pred_12 obj_14 obj_15)
       (pred_12 obj_14 obj_05)
       (pred_12 obj_14 obj_18)
       (pred_12 obj_15 obj_03)
       (pred_12 obj_15 obj_20)
       (pred_12 obj_15 obj_04)
       (pred_12 obj_15 obj_14)
       (pred_12 obj_20 obj_07)
       (pred_12 obj_20 obj_10)
       (pred_12 obj_20 obj_15)
       (pred_12 obj_01 obj_12)
       (pred_12 obj_01 obj_17)
       (pred_12 obj_01 obj_18)
       (pred_12 obj_17 obj_02)
       (pred_12 obj_17 obj_03)
       (pred_12 obj_17 obj_14)
       (pred_12 obj_17 obj_01)
       (pred_12 obj_03 obj_16)
       (pred_12 obj_03 obj_07)
       (pred_12 obj_03 obj_15)
       (pred_12 obj_03 obj_17)
       (pred_12 obj_07 obj_09)
       (pred_12 obj_07 obj_20)
       (pred_12 obj_07 obj_03)
       (pred_12 obj_12 obj_02)
       (pred_12 obj_12 obj_01)
       (pred_12 obj_02 obj_16)
       (pred_12 obj_02 obj_17)
       (pred_12 obj_02 obj_12)
       (pred_12 obj_16 obj_09)
       (pred_12 obj_16 obj_03)
       (pred_12 obj_16 obj_02)
       (pred_12 obj_09 obj_07)
       (pred_12 obj_09 obj_16)
       (pred_5 obj_10)
       (pred_5 obj_18)
       (pred_1  obj_10 obj_13)
       (pred_1  obj_18 obj_06)
       (pred_8 obj_19)
       (pred_8 obj_05)
       (pred_8 obj_04)
       (pred_8 obj_14)
       (pred_8 obj_15)
       (pred_8 obj_20)
       (pred_8 obj_01)
       (pred_8 obj_17)
       (pred_8 obj_03)
       (pred_8 obj_07)
       (pred_8 obj_12)
       (pred_8 obj_02)
       (pred_8 obj_16)
       (pred_8 obj_09)

       (pred_9  obj_08 obj_13)
       (pred_9  obj_11 obj_06)
       (pred_7 obj_08 obj_16)
       (pred_7 obj_11 obj_20)
       (pred_3 obj_05)
    )

    (:goal (and
       (pred_7 obj_11 obj_02)
    ))
(:constraints
  (always (not (pred_3 obj_15)))
)
)

; plan
1. (op_5 obj_05 obj_14)
   deleted: (pred_3 obj_05)
   added: (pred_3 obj_14)
   goals met: 0 of 1
2. (op_5 obj_14 obj_17)
   deleted: (pred_3 obj_14)
   added: (pred_3 obj_17)
   goals met: 0 of 1
3. (op_5 obj_17 obj_03)
   deleted: (pred_3 obj_17)
   added: (pred_3 obj_03)
   goals met: 0 of 1
4. (op_5 obj_03 obj_07)
   deleted: (pred_3 obj_03)
   added: (pred_3 obj_07)
   goals met: 0 of 1
5. (op_5 obj_07 obj_20)
   deleted: (pred_3 obj_07)
   added: (pred_3 obj_20)
   goals met: 0 of 1
6. (op_3 obj_20 obj_11)
   deleted: (pred_7 obj_11 obj_20) (pred_2)
   added: (pred_11 obj_11)
   goals met: 0 of 1
7. (op_5 obj_20 obj_07)
   deleted: (pred_3 obj_20)
   added: (pred_3 obj_07)
   goals met: 0 of 1
8. (op_5 obj_07 obj_03)
   deleted: (pred_3 obj_07)
   added: (pred_3 obj_03)
   goals met: 0 of 1
9. (op_5 obj_03 obj_17)
   deleted: (pred_3 obj_03)
   added: (pred_3 obj_17)
   goals met: 0 of 1
10. (op_5 obj_17 obj_02)
   deleted: (pred_3 obj_17)
   added: (pred_3 obj_02)
   goals met: 0 of 1
11. (op_2 obj_02 obj_11)
   deleted: (pred_11 obj_11)
   added: (pred_2) (pred_7 obj_11 obj_02)
   goals met: 1 of 1
